<a href="https://colab.research.google.com/github/jc7qx/LearningNotes/blob/master/pandas_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 資料處理

在這個文件中我們使用Pandas執行資料處理與分析。Pandas是一個Python套件，主要用於資料分析與處理。如果你還沒有安裝pandas套件，可以到[pandas官方網頁](https://pandas.pydata.org/)下載。如果你使用anaconda執行環境，它已包括pandas，可以直接使用。以下課程主要參考Datacamp教學網站有關pandas的課程內容。包含以下主題
* pandas基礎
* 資料導入
* 資料清理
* 資料處理

## pandas基礎

In [ ]:
import pandas as pd

使用pandas所提供的功能前先利用 **import pandas** 將pandas模組導入

首先我們先到Apple公司蒐集2021年1-6月Apple的股價(AAPL.csv)，將它儲存在data資料夾中。利用pandas檔案讀取功能，將Apple的股價資料讀進。

In [19]:
AAPL = pd.read_csv("https://raw.githubusercontent.com/jc7qx/pylearning/master/data/aapldata.csv")

In [20]:
AAPL.head()

        date    open    high       low   close    volume
0  2018/3/20  175.24  176.80  174.9400  175.24  19620520
1  2018/3/19  177.32  177.47  173.6600  175.30  32931110
2  2018/3/16  178.65  179.12  177.6200  178.02  38313330
3  2018/3/15  178.50  180.24  178.0701  178.65  22676520
4  2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [21]:
type(AAPL)

pandas.core.frame.DataFrame

In [22]:
AAPL.shape

(377, 6)

In [23]:
AAPL.columns

Index(['date', 'open', 'high', 'low', 'close', 'volume'], dtype='object')

In [24]:
type(AAPL.columns)

pandas.core.indexes.base.Index

In [25]:
AAPL.index

RangeIndex(start=0, stop=377, step=1)

In [26]:
type(AAPL.index)

pandas.core.indexes.range.RangeIndex

In [27]:
AAPL.iloc[:5, :]

        date    open    high       low   close    volume
0  2018/3/20  175.24  176.80  174.9400  175.24  19620520
1  2018/3/19  177.32  177.47  173.6600  175.30  32931110
2  2018/3/16  178.65  179.12  177.6200  178.02  38313330
3  2018/3/15  178.50  180.24  178.0701  178.65  22676520
4  2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [28]:
AAPL.iloc[-5:, :]

          date    open     high      low   close    volume
372  2016/9/26  111.64  113.390  111.550  112.88  29800240
373  2016/9/23  114.42  114.790  111.550  112.71  52411070
374  2016/9/22  114.35  114.940  114.000  114.62  31048170
375  2016/9/21  113.85  113.989  112.441  113.55  35951900
376  2016/9/20  113.05  114.120  112.510  113.57  34494150

In [29]:
AAPL.head(3)

        date    open    high     low   close    volume
0  2018/3/20  175.24  176.80  174.94  175.24  19620520
1  2018/3/19  177.32  177.47  173.66  175.30  32931110
2  2018/3/16  178.65  179.12  177.62  178.02  38313330

In [30]:
AAPL.tail()

          date    open     high      low   close    volume
372  2016/9/26  111.64  113.390  111.550  112.88  29800240
373  2016/9/23  114.42  114.790  111.550  112.71  52411070
374  2016/9/22  114.35  114.940  114.000  114.62  31048170
375  2016/9/21  113.85  113.989  112.441  113.55  35951900
376  2016/9/20  113.05  114.120  112.510  113.57  34494150

In [31]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 377 entries, 0 to 376
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    377 non-null    object
 1   open    377 non-null    float64
 2   high    377 non-null    float64
 3   low     377 non-null    float64
 4   close   377 non-null    float64
 5   volume  377 non-null    int64
dtypes: float64(4), int64(1), object(1)
memory usage: 17.8+ KB